{
  "headings": {
    "work": "Experience",
    "skills": "Skills",
    "projects": "Projects",
    "education": "Education"
  },
  "basics": {
    "name": "Abdurrahman Abu-Hijleh",
    "phone": "+972 599-113-856",
    "email": "aabuhijleh.dev@gmail.com",
    "website": "aabuhijleh.com"
  },
  "work": [
    {
      "company": "Ninja Van",
      "position": "Senior Software Engineer",
      "website": "https://www.ninjavan.co/en-sg/",
      "startDate": "Sep 2022",
      "endDate": "Present",
      "highlights": [
        "Led a team in developing an order management platform and spearheaded the design and release of new features, coordinating with cross-functional teams to ensure timely delivery and alignment with business goals",
        "Enhanced customer experience for web and mobile platforms by implementing feedback collection methods to identify and address improvement areas",
        "Resolved technical support tickets by debugging and addressing root causes, significantly reducing recurring issues and the overall volume of support requests",
        "Architected and implemented TypeScript integration for the website, enhancing code quality and maintainability",
        "Created accessible UI components for Ninja Van’s internal React design system, enforcing WCAG standards and setting up tooling to ensure compliance"
      ]
    },
    {
      "company": "Amdocs",
      "position": "Senior Software Engineer",
      "website": "https://www.amdocs.com/",
      "startDate": "Sep 2021",
      "endDate": "Sep 2022",
      "highlights": [
        "Led initiatives to refactor the codebase with modern React patterns, improving maintainability and developer efficiency, and reducing technical debt",
        "Contributed to a large-scale eCommerce web application using React, Redux, and TypeScript, focusing on improving user experience and accessibility",
        "Provided mentorship, fostering a culture of continuous improvement and knowledge sharing, leading to increased team productivity"
      ]
    },
    {
      "company": "Alcatel-Lucent Enterprise",
      "position": "Software Engineer",
      "website": "https://www.al-enterprise.com/",
      "startDate": "May 2018",
      "endDate": "Aug 2021",
      "highlights": [
        "Created and maintained a robust, cross-platform desktop application, leveraging TypeScript, Electron, and Node.js. Engineered OS-specific C++ integrations to access native APIs, ensuring seamless functionality for tens of thousands of users",
        "Engineered complex features for the desktop application based on customer needs, including USB headset support utilizing SDKs and the USB HID protocol, and developed remote desktop control using WebRTC",
        "Developed a Google Chrome extension using TypeScript, enabling seamless browser access to communication features",
        "Mentored junior developers, guiding them through the onboarding process and accelerating their integration into the team"
      ]
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "keywords": ["JavaScript", "TypeScript", "Python", "HTML", "CSS/Sass"]
    },
    {
      "name": "Libraries & Frameworks",
      "keywords": [
        "React",
        "Node",
        "Django",
        "Electron",
        "Next.js",
        "Tailwind",
        "Styled Components"
      ]
    },
    {
      "name": "Databases, Tools & Platforms",
      "keywords": [
        "PostgreSQL",
        "Redis",
        "Git",
        "Vercel",
        "Docker",
        "Webpack",
        "Vite",
        "Storybook",
        "Firebase"
      ]
    }
  ],
  "projects": [
    {
      "name": "Better GitHub Profile",
      "description": "An app that generates a portfolio website using GitHub profile data. By simply updating the information on GitHub, users can refresh their site content. This tool is currently utilized for my personal website.",
      "url": "github.com/aabuhijleh/better-github-profile",
      "keywords": [
        "React",
        "TypeScript",
        "Styled Components",
        "GitHub GraphQL API"
      ]
    },
    {
      "name": "Keylogger.js",
      "description": "An npm package created initially to solve the need for a reliable push-to-talk feature. It captures keyboard activity through native Windows and macOS APIs. I created a simple JavaScript API that streamlines the process for developers.",
      "url": "github.com/aabuhijleh/keylogger.js",
      "keywords": [
        "Node.js",
        "N-API",
        "Windows C++ APIs",
        "macOS Objective-C++ APIs"
      ]
    }
  ],
  "education": [
    {
      "institution": "An-Najah National University",
      "area": "Computer Engineering",
      "studyType": "Bachelor of Science",
      "location": "Nablus, West Bank",
      "startDate": "Sep 2013",
      "endDate": "May 2018"
    }
  ],
  "sections": ["profile", "work", "skills", "projects", "education"]
}
